from TG.app import start


# Есть какая то проблема индексаций в ДБ , так что если чето по пизде пойдет, проверь это

"""
Ну запулить предложения то мы запулили, (тут было по другому, но я передумал), сделай модель под неправильные предложения
и потом просто закинь туда все переделанные предложения через дешифратор, и мозги себе не еби, хотя тут определенно, могут возникнуть проблемы 
с перемешиванием ибо как я разделять то собираюсь? Т.е логичнее перемешивать именно шифрованную часть?
И потом из нее собирать предложение?
Ну это имеет смысл, и это по идее даже легче.
"""


if __name__ == '__main__':
    start()



